Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: In this case, the Maven dependency is not at all required in the `pom.xml` file.
ja_jp: この場合、 `pom.xml` では、Maven の依存関係は全く必要ありません。

source: In this case, the Maven dependency is not at all required in the `pom.xml`.
ja_jp: この場合、 `pom.xml` では、Maven の依存関係は全く必要ありません。

source: In this case, the `Consumer#bean` injection point will cause ambiguity error, because both `MyBean` producers will have the `@Default` qualifier.
ja_jp: この場合、`MyBean` の両方のプロデューサーが `@Default` 修飾子を持つため、`Consumer#bean` のインジェクションポイントはあいまいさエラーを引き起こします。

source: In this case, the configuration maps the incoming Cloud Event type `defaultChain.output` to the `configChain` function. The `configChain` function maps its response to the `annotated` Cloud Event type, and the Cloud Event source `configChain`.
ja_jp: この場合、この構成では、受信するCloud Eventのタイプ `defaultChain.output` を `configChain` 関数にマッピングします。 `configChain` 関数は、そのレスポンスを `annotated` Cloud Event タイプに、Cloud Event ソース `configChain` にマッピングします。

source: In this case, the connector looks for the `Map` associated with the `my-configuration` name. If `kafka-configuration` is not set, an optional lookup for a `Map` exposed with the channel name (`my-channel` in the previous example) is done.
ja_jp: この場合、コネクターは `my-configuration` 名に関連付けられた `Map` を探します。 `kafka-configuration` が設定されていない場合、チャネル名 (前の例では `my-channel`) で公開された `Map` のオプションの検索が実行されます。

source: In this case, the default client is disabled with a `client-enabled=false` property. The `jwt-secret` client can be accessed like this:
ja_jp: この場合、デフォルトのクライアントは `client-enabled=false` プロパティーで無効になっています。 `jwt-secret` クライアントは以下のようにアクセスできます。

source: In this case, the extension is declaring two capabilities.
ja_jp: この場合、エクステンションは2つのケイパビリティを宣言しています。

source: In this case, the mapping won't fail if there are not configuration properties to match the mapping.
ja_jp: この場合、マッピングにマッチする設定プロパティがなければ、マッピングは失敗しません。

source: In this case, the mapping won't fail if there is no configuration property to match the mapping.
ja_jp: この場合、マッピングにマッチする設定プロパティがなければ、マッピングは失敗しません。

source: In this case, the name "foo" is used as a logger name. The logger is created with `org.jboss.logging.Logger.getLogger("foo")`.
ja_jp: この場合、 "foo" という名前がロガー名として使用されます。ロガーは `org.jboss.logging.Logger.getLogger("foo")` で作成されます。

source: In this case, the name _foo_ is used as a logger name, for example, `org.jboss.logging.Logger.getLogger("foo")` will be used.
ja_jp: この場合、 _foo_ という名前がロガー名として使われ、例えば、 `org.jboss.logging.Logger.getLogger("foo")` が使われます。

source: In this case, the name _foo_ is used as a logger name, for example,`org.jboss.logging.Logger.getLogger("foo")` will be used.
ja_jp: この場合、 _foo_ という名前がロガー名として使われ、例えば、 `org.jboss.logging.Logger.getLogger("foo")` が使われます。

source: In this case, the name _foo_ is used as a logger name, i.e. `org.jboss.logging.Logger.getLogger("foo")` will be used.
ja_jp: `org.jboss.logging.Logger.getLogger("foo")` この場合、ロガー名として _foo_ という名前が使われます。

source: In this case, the registration flow is a little different because you will write your own registration endpoint which will handle storing of the credentials and setting up the session cookie:
ja_jp: この場合、登録フローは少し異なります。認証情報の保存とセッション Cookie のセットアップを処理する 独自の登録エンドポイントを作成するためです。

source: In this case, the rendering only starts once the subscriber requests it.
ja_jp: この場合、サブスクライバーが要求した場合にのみレンダリングが開始されます。

source: In this case, the result is an array, so we can loop over it.
ja_jp: ここでの結果は配列であるため、それをループすることができます。

source: In this case, the result is an object, so we just add it to our list of jokes. This could also be an array if the server returned some collection.
ja_jp: この場合、結果はオブジェクトなので、ジョークのリストに追加します。サーバーが何らかのコレクションを返した場合、これは配列になることもあります。

source: In this case, use the parameter `-Dquarkus.native.remote-container-build=true` instead of `-Dquarkus.native.container-build=true`.
ja_jp: この場合、パラメータ `-Dquarkus.native.container-build=true` の代わりに `-Dquarkus.native.remote-container-build=true` を使用してください。

source: In this case, we only care about customizing the HTTP server, so we just override the `customizeHttpServer` method, but users should be aware that `HttpServerOptionsCustomizer` allows configuring the HTTPS and Domain Socket servers as well
ja_jp: この場合、HTTPサーバーのカスタマイズにしか関心がないので、 `customizeHttpServer` メソッドをオーバーライドするだけですが、 `HttpServerOptionsCustomizer` ではHTTPSサーバーとドメイン・ソケット・サーバーも設定できることに注意して下さい。

source: In this case, we use `Fruit.findById` to retrieve the fruit. It returns a `Uni`, which will complete when the database has retrieved the row.
ja_jp: この場合、 `Fruit.findById` を使ってフルーツを取得します。これは、データベースが行を取得したときに完了する `Uni` を返します。

source: In this case, we use the `@Location` qualifier to specify the template path: `templates/reports/v1/report_01.html`.
ja_jp: この場合、 `@Location` 修飾子を使用してテンプレートのパスを指定します: `templates/reports/v1/report_01.html` .

source: In this case, you can customize pool creation by creating a class implementing an interface which depends on the target database:
ja_jp: この場合、対象データベースに依存するインターフェイスを実装したクラスを作成することで、プール作成をカスタマイズすることができます:

source: In this case, you can use the `WebAuthn.loginClientSteps` and `WebAuthn.registerClientSteps` methods from the JavaScript library, store the authenticator data in hidden form elements, and send them as part of your form payload to the server to your custom login or registration endpoints.
ja_jp: この場合、JavaScript ライブラリーの `WebAuthn.loginClientSteps` と `WebAuthn.registerClientSteps` メソッドを使用して、 オーセンティケーターデータを非表示フォーム要素に保存し、 それらをフォームのペイロードの一部としてサーバーのカスタムログインまたは登録エンドポイントに送信できます。

source: In this case, you can use the `WebAuthn.loginOnly` and `WebAuthn.registerOnly` methods from the JavaScript library, store the authenticator data in hidden form elements, and send them as part of your form payload to the server to your custom login or registration endpoints.
ja_jp: この場合、JavaScript ライブラリの `WebAuthn.loginOnly` と `WebAuthn.registerOnly` メソッドを使用し、認証データを hidden フォーム要素に格納し、フォームペイロードの一部としてサーバーに送信し、カスタムログインまたは登録エンドポイントに送信することができます。

source: In this case, you must also deactivate those other extensions.
ja_jp: この場合、それらの他のエクステンションも非アクティブ化する必要があります。

source: In this case, you must also deactivate those other extensions. To see an example of this scenario, refer to the xref:hibernate-orm.adoc#persistence-unit-active[Activate/deactivate persistence units] section of the Hibernate ORM guide. For Hibernate ORM, Quarkus deactivates the persistence unit when the datasource is inactive.
ja_jp: この場合、それらの他のエクステンションも非アクティブ化する必要があります。 このシナリオの例については、Hibernate ORM ガイドの xref:hibernate-orm.adoc#persistence-unit-active[永続化ユニットのアクティブ化/非アクティブ化] セクションを参照してください。 Hibernate ORM の場合、データソースが非アクティブなとき、Quarkus は永続化ユニットを非アクティブ化します。

source: In this case, you must also deactivate those other extensions. To see an example of this scenario, refer to xref:hibernate-orm.adoc#persistence-unit-active[this section of the Hibernate ORM guide].
ja_jp: この場合、他のエクステンションも停止する必要があります。このシナリオの例については、 xref:hibernate-orm.adoc#persistence-unit-active[Hibernate ORM ガイドのこのセクション] を参照してください。

source: In this case, you need to explicitly add a dependency to your project. For example, if you need to include the native library for `linux-aarch64`, you can add the following dependency:
ja_jp: この場合、プロジェクトに依存関係を明示的に追加する必要があります。 たとえば、 `linux-aarch64` のネイティブライブラリーを含める必要がある場合は、次の依存関係を追加できます。

source: In this case, you need to extend `WithId.AutoLong` (or any other ID class or provide your own ID), and implement the `PanacheEntity.Stateless` and `PanacheRepository.Stateless` interfaces:
ja_jp: この場合、`WithId.AutoLong` (またはその他の ID クラス、あるいは独自の ID) を拡張し、`PanacheEntity.Stateless` および `PanacheRepository.Stateless` インターフェースを実装する必要があります。

source: In this case, you should configure OIDC client registration to perform the registration at the request time, as opposed to at the startup time:
ja_jp: この場合、起動時ではなくリクエスト時に登録を実行するように OIDC クライアント登録を設定する必要があります。

source: In this case, you'll need to define the schema for your Java type using `@Proto` and `@ProtoSchema`. This schema can encompass all types and adapters used in your Quarkus application.
ja_jp: この場合、 `@Proto` と `@ProtoSchema` を使用して Java 型のスキーマを定義する必要があります。このスキーマには、Quarkus アプリケーションで使用されるすべての型とアダプターを含めることができます。

source: In this class, we inject an `Emitter,` i.e., an object responsible for sending a message to a channel. This emitter is attached to the `movies-out` channel (and will send messages to AMQP). The connector automatically encoded the content as JSON and set the `content-type` header.
ja_jp: このクラスでは、 `Emitter,` 、つまりチャンネルへのメッセージ送信を担当するオブジェクトを注入します。このエミッタは `movies-out` チャンネルにアタッチされています (AMQP にメッセージを送信します)。コネクタは自動的にコンテンツを JSON としてエンコードし、 `content-type` ヘッダを設定します。

source: In this class, we inject an `Emitter`, i.e., an object responsible for sending a message to a channel. This emitter is attached to the `movies-out` channel (and so will send messages to Kafka). We are sending `Record` objects containing the movie's publication year as key and its title as value.
ja_jp: このクラスでは、 `Emitter` 、つまりチャンネルへのメッセージ送信を担当するオブジェクトを注入します。このエミッタは `movies-out` チャンネルにアタッチされています (つまり、Kafka にメッセージを送信します)。映画の公開年をキーに、タイトルを値にして `Record` オブジェクトを送信しています。

source: In this configuration the credentials for users `alice` and `bob` are configured: `alice` has a password `alice` and an `admin` role, `bob` has a password `bob` and a `user` role.
ja_jp: この設定では、ユーザー `alice` と `bob` のクレデンシャルが設定されています。 `alice` はパスワード `alice` と `admin` ロール、 `bob` はパスワード `bob` と `user` ロールが設定されています。

source: In this context, it's better to depend only on what you need, by adding a dependency to the Kubernetes Client extension and only the minimum OpenShift model dependencies:
ja_jp: この文脈では、Kubernetes クライアントエクステンションと最小限の OpenShift モデル依存関係のみに依存を追加することで、必要なものだけを依存させる方が良いでしょう。

source: In this document the `QuarkusApplication` instance is referred to as the application main, and a class with a Java main method is the Java main.
ja_jp: このドキュメントでは、 `QuarkusApplication` インスタンスをアプリケーション mainと呼び、Java mainメソッドを持つクラスを Java mainと呼びます。

source: In this example `initial-delay` and `period` are fields of the type `Probe`. Below you will find tables describing all available types.
ja_jp: この例では、 `initial-delay` と `period` は `Probe` タイプのフィールドです。以下に、利用可能なすべてのタイプを説明した表を示します。

source: In this example `library-b` is a regular Maven artifact that will be added as a dependency of the `quarkus-extension-a` only when an application is launched in dev mode.
ja_jp: この例では、 `library-b` は通常の Maven アーティファクトであり、アプリケーションが開発モードで起動された場合にのみ `quarkus-extension-a` の依存関係として追加されます。

source: In this example a scheduler is created by capturing the context of the Vert.x event-loop that calls `asyncStart()`. The `delayIt` operator uses that scheduler, and we can check that the context that we get in `invoke` is a Vert.x duplicated context where the data for key `"foo"` has been propagated.
ja_jp: この例では、 `asyncStart()` を呼び出す Vert.x イベントループのコンテキストをキャプチャーすることによってスケジューラーが作成されます。 `delayIt` オペレーターはそのスケジューラーを使用しています。 `invoke` で取得したコンテキストが、キー `"foo"` のデータが伝播された Vert.x の複製されたコンテキストであることを確認できます。

source: In this example we used JSON Schema with Pulsar messages. For more information on Pulsar Schemas, see xref:pulsar.adoc#pulsar-schema-configuration[Pulsar Reference Guide - Schema].
ja_jp: この例では、Pulsar メッセージで JSON スキーマを使用しています。 Pulsar スキーマの詳細は、 xref:pulsar.adoc#pulsar-schema-configuration[Pulsar リファレンスガイド - スキーマ] を参照してください。

source: In this example we used Jackson to serialize/deserialize Kafka messages. For more options on message serialization, see xref:kafka.adoc#kafka-serialization[Kafka Reference Guide - Serialization].
ja_jp: この例では、Jackson を使用して Kafka メッセージをシリアライズ/デシリアライズしました。メッセージのシリアルライズに関するその他のオプションについては、xref:kafka.adoc#kafka-serialization[Kafka リファレンスガイド - シリアル化] を参照してください。

source: In this example you can note the following:
ja_jp: この例では、次のことに注意してください:

source: In this example, I only exclude the `src` directory:
ja_jp: この例では、 `src` ディレクトリーだけを除外しています。

source: In this example, `private.key.from.vault` and `public.key.from.vault` are `PEM` or `JWK` formatted key values provided by the custom `ConfigSource`.
ja_jp: この例では、 `private.key.from.vault` と `public.key.from.vault` は、カスタム `ConfigSource` によって提供される `PEM` または `JWK` 形式のキー値です。

source: In this example, a singleton CDI bean will produce two different `MeterFilter` beans. One will be applied only to Prometheus `MeterRegistry` instances (using the `@MeterFilterConstraint` qualifier), and another will be applied to all `MeterRegistry` instances. An application configuration property is also injected and used as a tag value. Additional examples of MeterFilters can be found in the link:https://micrometer.io/docs/concepts[official documentation].
ja_jp: この例では、シングルトン CDI Beanは、2 つの異なる `MeterFilter` Beanを生成します。1 つは Prometheus `MeterRegistry` インスタンスのみに適用され ( `@MeterFilterConstraint` 修飾子を使用)、もう 1 つはすべての `MeterRegistry` インスタンスに適用されます。アプリケーション設定プロパティーも注入され、タグ値として使用されます。MeterFiltersのその他の例は、次のリンクにあります：link:https://micrometer.io/docs/concepts[公式ドキュメント] 。

source: In this example, an application is built with two Jakarta REST resources, `FrontendResource` and `ProtectedResource`. Here, `FrontendResource` uses one of three methods to propagate access tokens to `ProtectedResource`:
ja_jp: この例では、アプリケーションは 2 つの Jakarta REST リソース FrontendResource と ProtectedResource を使用して構築されます。 ここで、 `FrontendResource` は 3 つの方法のいずれかを使用してアクセストークンを `ProtectedResource` に伝播します。

source: In this example, both `doSomething` and `doSomethingElse` will be intercepted by the hypothetical logging interceptor. Additionally, the `doSomethingElse` method will be intercepted by the hypothetical tracing interceptor.
ja_jp: この例では、 `doSomething` と `doSomethingElse` の両方が架空のロギングインターセプターによってインターセプトされます。さらに、 `doSomethingElse` メソッドは、架空のトレースインターセプターによってインターセプトされます。

source: In this example, interceptor bindings are read from the `MyClass` class.
ja_jp: この例では、インターセプターバインディングは `MyClass` クラスから読み取られます。

source: In this example, the `@ApplicationPath` is set to `/api`, and the code on the method declaration (below) takes that into account when generating the URL.
ja_jp: この例では、 `@ApplicationPath` は `/api` に設定されており、メソッド宣言上のコード（下記）はそれを考慮して URL を生成しています。

source: In this example, the `rename-project` permission checker is declared on the same resource. However, there is no restriction on where this permission checker can be declared as demonstrated in the next example.
ja_jp: この例では、 `rename-project` 権限チェッカーが同じリソースで宣言されています。 ただし、次の例に示すように、この権限チェッカーを宣言できる場所に制限はありません。

source: In this example, the cluster role "my-cluster-role" will be generated with the specified policy rules.
ja_jp: この例では、指定されたポリシールールでクラスタロール"my-cluster-role"が生成されることになります。

source: In this example, the delay between retrying the method, and the maximum duration in which to attempt a retry are the same. This would imply these settings are not being used as intended. When member values like `jitter` & `jitterDelayUnit` are used to add more complexity, these warnings can serve as a good indication of improperly configured values.
ja_jp: この例では、メソッドを再試行するまでの遅延時間と、再試行を試みるまでの最大時間が同じです。これは、これらの設定が意図したとおりに使用されていないことを意味します。 `jitter` や `jitterDelayUnit` のようなメンバ値を使用してさらに複雑にした場合、これらの警告は不適切に設定された値を示す良い指標となります。

source: In this example, the role "my-role" will be generated with a policy rule to get the list of deployments.
ja_jp: この例では、デプロイメントのリストを取得するためのポリシールールを持つロール"my-role"が生成されることになります。

source: In this example, the role "my-role" will be generated with the specified policy rules.
ja_jp: この例では、指定されたポリシールールでロール "my-role" が生成されます。

source: In this example, the root category is configured to use two handlers: `console` and `mylog`.
ja_jp: この例では、ルート・カテゴリは、 `console` と `mylog` の2つのハンドラを使用するように設定されています。

source: In this example, the root category is configured to use two named handlers: `con` and `mylog`.
ja_jp: この例では、ルートカテゴリーは、 `con` と `mylog` という 2 つの名前付きハンドラーを使用するように設定されています。

source: In this example, the transaction is automatically committed on success or rolled back on failure.
ja_jp: この例では、トランザクションは成功時に自動的にコミットされるか、失敗時にロールバックされます。

source: In this example, the value of the last request path segment is a tenant id, but if required, you can implement a more complex tenant identifier resolution logic.
ja_jp: この例では、最後のリクエストパスセグメントの値はテナント ID ですが、必要に応じて、より複雑なテナント ID 解決ロジックを実装できます。

source: In this example, two named proxies are configured. The proxies are named `local` and `my-proxy`. Extensions can reference these proxies by name when required.
ja_jp: この例では、`local` と `my-proxy` という 2 つの名前付きプロキシーが設定されています。エクステンションは必要に応じてこれらのプロキシーを名前で参照できます。

source: In this example, we are using a single instance running on localhost, and the keyspace containing our data is `k1`:
ja_jp: この例では、localhost上で動作する単一のインスタンスを使用しており、データを含むキースペースは `k1` となっています。

source: In this example, we are using a single instance running on localhost:
ja_jp: この例では、ローカルホスト上で実行されている単一のインスタンスを使用しています。

source: In this example, we build a simple web application with a single page:
ja_jp: この例では、1つのページでシンプルなWebアプリケーションを構築します：

source: In this example, we build a very simple application that supports two resource methods:
ja_jp: この例では、次の 2 つのリソースメソッドをサポートする非常にシンプルなアプリケーションをビルドします。

source: In this example, we build a very simple application which offers a single land page:
ja_jp: この例では、単一のランディングページを提供する非常にシンプルなアプリケーションを構築しています。

source: In this example, we build a very simple application which supports two resource methods:
ja_jp: この例では、2つのリソースメソッドをサポートする非常にシンプルなアプリケーションを構築します:

source: In this example, we build a very simple microservice that offers one REST endpoint. This endpoint serves for determining whether a number is prime. The implementation class is annotated with certain metric annotations so that while responding to users' requests, certain metrics are gathered. The meaning of each metric is explained later.
ja_jp: この例では、1つのRESTエンドポイントを提供する非常にシンプルなマイクロサービスを作成します。このエンドポイントは、ある数字が素数かどうかを判断するためのものです。この実装クラスには、ユーザーのリクエストに応答する際に特定のメトリクスを収集するように、特定のメトリクスのアノテーションが付けられています。各メトリックの意味については後述します。

source: In this example, we build a very simple microservice which offers four endpoints:
ja_jp: この例では、4つのエンドポイントを提供する、非常にシンプルなマイクロサービスを構築します:

source: In this example, we build a very simple microservice which offers one REST endpoint:
ja_jp: この例では、1つのRESTエンドポイントを提供する非常にシンプルなマイクロサービスを構築します。

source: In this example, we build a very simple microservice which offers three endpoints:
ja_jp: この例では、3つのエンドポイントを提供する非常にシンプルなマイクロサービスを構築します:

source: In this example, we build a very simple microservice which offers two endpoints:
ja_jp: この例では、2つのエンドポイントを提供する非常にシンプルなマイクロサービスを構築しています。

source: In this example, we build a very simple web application with a single page:
ja_jp: この例では、1ページの非常にシンプルなWebアプリケーションを構築しています。

source: In this example, we exclude log records containing specific text from console logs. The specific text to filter on is not hard-coded; instead, it is read from the `my-filter.part` configuration property.
ja_jp: この例では、コンソールログから特定のテキストを含むログレコードを除外します。 フィルタリングする特定のテキストはハードコードされておらず、 `my-filter.part` 設定プロパティから読み込まれます。

source: In this example, we have added a named query to list all the persons that contains some text in the `name` field.
ja_jp: この例では、 `name` フィールドにテキストを含むすべての人物をリストアップする名前付きクエリを追加しています。

source: In this example, we will build an application which consists of two JAX-RS resources, `FrontendResource` and `ProtectedResource`. `FrontendResource` propagates access tokens to `ProtectedResource` and uses either `OpenID Connect Client Reactive Filter` to acquire a token first before propagating it or `OpenID Token Propagation Reactive Filter` to propagate the incoming, already existing access token.
ja_jp: この例では、 `FrontendResource` と `ProtectedResource` という 2 つの JAX-RS リソースで構成されるアプリケーションを作成します。FrontendResource` は、 `OpenID Connect Client Reactive Filter` を使用してアクセストークンを取得してからそれを伝播するか、 `OpenID Token Propagation Reactive Filter` を使用して受信した既存のアクセストークンを伝播して、アクセストークンを `ProtectedResource` に伝播します。

source: In this example, we will build an application which consists of two Jakarta REST resources, `FrontendResource` and `ProtectedResource`. `FrontendResource` propagates access tokens to `ProtectedResource` and uses either `OpenID Connect Client Reactive Filter` to acquire a token first before propagating it or `OpenID Token Propagation Reactive Filter` to propagate the incoming, already existing access token.
ja_jp: この例では、 `FrontendResource` と `ProtectedResource` という2つの Jakarta REST リソースからなるアプリケーションを構築します。 `FrontendResource` はアクセストークンを `ProtectedResource` に伝播し、伝播前にまずトークンを取得するために `OpenID Connect Client Reactive Filter` を使用するか、受信した既に存在するアクセストークンを伝播するために `OpenID Token Propagation Reactive Filter` のいずれかを使用しています。

source: In this example, we will create a slimmed down version of the model classes manually, with only the fields that we need, and ignore all the stuff that we don't need. We will need the classes for `Film` and `Planet`. But, the service is also using specific wrappers named `FilmConnection` and `PlanetConnection`, which, for our purpose, will serve just to contain the actual list of `Film` and `Planet` instances, respectively.
ja_jp: この例では、必要なフィールドだけを持ち、必要のないものはすべて無視して、モデルクラスのスリムなバージョンを手動で作成します。必要なのは、 `Film` と `Planet` のクラスです。しかし、このサービスでは、 `FilmConnection` と `PlanetConnection` という名前の特定のラッパーも使用しており、今回の目的では、それぞれ `Film` と `Planet` のインスタンスの実際のリストを格納するだけです。

source: In this example, we will create an application to manage a list of fruits.
ja_jp: この例では、果物のリストを管理するアプリケーションを作成します。

source: In this example, we will create two background functions and a cloud events function. Background functions allow you to react to Google Cloud events like PubSub messages, Cloud Storage events, Firestore events, ... Cloud events functions allow you to react to supported events using the Cloud Events specification.
ja_jp: この例では、2 つのバックグラウンド関数とcloud events functionを作成します。バックグラウンド関数は、PubSub メッセージ、Cloud Storage イベント、Firestore イベントなどの Google Cloud eventに対応することができます。cloud events functionを使用すると、Cloud Events 仕様を使用して、サポートされているイベントに対応できます。

source: In this example, we will create two background functions. Background functions allow to react to Google Cloud events like PubSub messages, Cloud Storage events, Firestore events, ...
ja_jp: この例では、2 つのバックグラウンド関数を作成します。バックグラウンド関数は、PubSub メッセージ、Cloud Storage イベント、Firestore イベントなどの Google Cloud イベントに反応することができます。

source: In this example, we would like to demonstrate the _basic workflow_ when working with Qute templates. Let's start with a simple "hello world" example. We will always need some *template contents*:
ja_jp: この例では、Quteのテンプレートを扱う際の基本的なワークフローをデモしたいと思います。まず、簡単なhello worldの例から始めましょう。 *テンプレートのコンテンツ* は必ず必要になります。

source: In this example, we're creating a copy of the default object mapper. You should *NEVER* modify the default object mapper, but create a copy instead.
ja_jp: この例では、デフォルトのオブジェクトマッパーのコピーを作成しています。デフォルトのオブジェクトマッパーは *絶対に* 変更しないでください。代わりにコピーを作成してください。

source: In this example:
ja_jp: この例では:

source: In this exercise, we profile the runtime behaviour of some Quarkus application that was compiled to a native executable to determine where the bottleneck is. Assume that you’re in a scenario where profiling the pure Java version is not possible, maybe because the issue only occurs with the native version of the application.
ja_jp: この演習では、ネイティブ実行可能ファイルにコンパイルされたQuarkusアプリケーションの実行時動作をプロファイリングし、ボトルネックがどこにあるかを判断します。問題がアプリケーションのネイティブバージョンでのみ発生するために、純粋なJavaバージョンのプロファイリングができないシナリオを想定しています。

source: In this file there are some example rules to decide whether the Loan should be approved or not. The service wants the Applicant to have an age equal or greater than 20 and more than 1000 currency on their bank account. The amount of the Loan shouldn't be more than the `maxAmount`.
ja_jp: このファイルには、ローンが承認されるべきかどうかを決定するためのルールの例があります。このサービスでは、申請者の年齢が20歳以上で、銀行口座に1,000通貨以上の預金があることを求めています。ローンの金額は `maxAmount` を超えてはいけません。
